tests/Omnipay/PayPal/Mock/GetExpressCheckoutDetailsSuccess.txt

HTTP/1.1 200 OK
Server: Apache
Content-Length: 1378
Content-Type: text/plain; charset=utf-8
DC: origin2-api-3t.sandbox.paypal.com
Date: Thu, 03 Apr 2014 11:20:35 GMT
Connection: keep-alive
Set-Cookie: DC=origin2-api-3t.sandbox.paypal.com; secure

TOKEN=EC%2d6CG32037X9158254D&CHECKOUTSTATUS=PaymentActionNotInitiated&TIMESTAMP=2014%2d04%2d03T11%3a20%3a35Z&CORRELATIONID=8f3b132a50bfc&ACK=Success&VERSION=112%2e0&BUILD=10433064&EMAIL=payments%2etest%2ede%40cherrygroup%2ecom&PAYERID=LWKQVB7EWEDJC&PAYERSTATUS=verified&FIRSTNAME=Cherry&LASTNAME=Germany&COUNTRYCODE=DE&SHIPTONAME=Cherry%20Germany&SHIPTOSTREET=ESpachstr%2e%201&SHIPTOCITY=Freiburg&SHIPTOSTATE=Empty&SHIPTOZIP=79111&SHIPTOCOUNTRYCODE=DE&SHIPTOCOUNTRYNAME=Germany&ADDRESSSTATUS=Unconfirmed&CURRENCYCODE=SEK&AMT=20%2e12&SHIPPINGAMT=0%2e00&HANDLINGAMT=0%2e00&TAXAMT=0%2e00&INVNUM=payp%2dpayp277094&INSURANCEAMT=0%2e00&SHIPDISCAMT=0%2e00&PAYMENTREQUEST_0_CURRENCYCODE=SEK&PAYMENTREQUEST_0_AMT=20%2e12&PAYMENTREQUEST_0_SHIPPINGAMT=0%2e00&PAYMENTREQUEST_0_HANDLINGAMT=0%2e00&PAYMENTREQUEST_0_TAXAMT=0%2e00&PAYMENTREQUEST_0_INVNUM=payp%2dpayp277094&PAYMENTREQUEST_0_INSURANCEAMT=0%2e00&PAYMENTREQUEST_0_SHIPDISCAMT=0%2e00&PAYMENTREQUEST_0_INSURANCEOPTIONOFFERED=false&PAYMENTREQUEST_0_SHIPTONAME=Cherry%20Germany&PAYMENTREQUEST_0_SHIPTOSTREET=ESpachstr%2e%201&PAYMENTREQUEST_0_SHIPTOCITY=Freiburg&PAYMENTREQUEST_0_SHIPTOSTATE=Empty&PAYMENTREQUEST_0_SHIPTOZIP=79111&PAYMENTREQUEST_0_SHIPTOCOUNTRYCODE=DE&PAYMENTREQUEST_0_SHIPTOCOUNTRYNAME=Germany&PAYMENTREQUEST_0_ADDRESSSTATUS=Unconfirmed&PAYMENTREQUEST_0_ADDRESSNORMALIZATIONSTATUS=None&PAYMENTREQUESTINFO_0_ERRORCODE=0